views/tugas/_form.php

            ],
        ]);
      }
      $pegawai = ArrayHelper::map(\app\models\Pegawai::find()->where(['!=', 'id', 1])->all(), 'id', 'nama');
      $seksi = ArrayHelper::map(\app\models\Seksi::find()->all(), 'id', 'seksi');
---
SELECT * FROM `pegawai` WHERE `id` != 1
SELECT * FROM `seksi`