controllers/IjincutiController.php

SELECT * FROM `ijincuti` WHERE `id`='22'
---
    protected function findModel($id)
    {
        if (($model = Ijincuti::findOne($id)) !== null) {