controllers/SiteController.php

SELECT * FROM `tugas` WHERE (`date_end` <= '2021-12-31') AND (`date_start` >= '2021-12-01') AND (NOT (`nosurat`='')) AND (NOT (`nosurat`='x')) AND (NOT (`tugas`.`sppd`='2'))
SELECT * FROM `tugas` WHERE (((`date_end` <= '2020-02-29') AND (`date_start` >= '2020-02-01')) AND (NOT (`nosurat`=''))) AND (NOT (`nosurat`='x'))
SELECT * FROM `holiday` WHERE (`tanggal` <= '2021-12-31') AND (`tanggal` >= '2021-12-01')
---
    public function actionIndex()
    {
        $lastdate=date('Y-m-t');
        $firstdate = date('Y-m-01');
        $model = Tugas::find()
                ->andWhere(['<=', 'date_end', $lastdate])
                ->andWhere(['>=', 'date_start', $firstdate])
                ->andWhere(['not',['nosurat'=>'']])
                ->andWhere(['not',['nosurat'=>'x']])
                ->andWhere(['not',['tugas.sppd'=>'2']])
                ->all();
        $harilibur = Holiday::find()
                ->andWhere(['<=', 'tanggal', $lastdate])
                ->andWhere(['>=', 'tanggal', $firstdate])
                ->all();