controllers/TugasController.php

SELECT `id` FROM `pegawai` WHERE nama LIKE '%Andi Cakra Atmajaya%'
---
    public function actionGetidpegawai($nama,$date)
    {
      $model = Pegawai::find()
        ->select('id')
        ->where('nama LIKE :query')
        ->addParams([':query'=>'%'.$nama.'%'])
        ->asArray()
        ->one();

SELECT * FROM `tugas` WHERE `id`='1352'
SELECT * FROM `pegawai` WHERE `id`=3
SELECT * FROM `tugas` WHERE `id_pegawai`='3'
---
     public function actionReport($id_tugas,$id_pegawai,$kolektif) {
      $helper=Yii::$app->myHelper;
      $tugas = Tugas::findOne($id_tugas);
      $isluarkota=$tugas->is_luar_kota;
      $pegawai = Tugas::findOne([
          'id_pegawai' => $id_pegawai,
      ])->idPegawai;

SELECT * FROM `tugas` WHERE `id`='1353'
---
    protected function findModel($id)
    {
        if (($model = Tugas::findOne($id)) !== null) {