components/myHelper.php

  public function config()
  {
    $c=\app\models\Config::findOne([
      'id'=>'1'
    ]);
---
SELECT * FROM `config` WHERE `id`='1'

  public function seksiById($id)
  {
    $p=\app\models\Seksi::findOne([
      'id'=>$id
    ]);
---
SELECT * FROM `seksi` WHERE `id`=5

  public function pegawaiByJabatan($id_jabatan)
  {
    $p=\app\models\Pegawai::findOne([
            'id_jabatan'=>$id_jabatan
          ]);
---
SELECT * FROM `pegawai` WHERE `id_jabatan`='8'
SELECT `jabatan` FROM `jabatan` WHERE `id_jabatan`=1

  public function pegawaiById($id)
  {
    $p=\app\models\Pegawai::findOne([
            'id'=>$id
          ]);
---
SELECT * FROM `pegawai` WHERE `id`='4'

  public function isKepalaseksi($id_jabatan)
  {
    $jabatan=\app\models\Jabatan::find()
    ->select(['jabatan'])
    ->where(['id_jabatan'=>$id_jabatan])
    ->one();
---
SELECT `jabatan` FROM `jabatan` WHERE `id_jabatan`=21