views/site/index.php

use yii\helpers\ArrayHelper;
use yii\web\View;
use yii\web\JSExpression;
  $pegawai=ArrayHelper::map(\app\models\Pegawai::find()->where(['!=', 'id', 1])->all(), 'id', 'nama');
---
SELECT * FROM `pegawai` WHERE `id` != 1