views/ijincuti/_form.php

            ],
        ]);
      }
      $pegawai = ArrayHelper::map(\app\models\Pegawai::find()->where(['!=', 'id', 1])->all(), 'id', 'nama');
---
SELECT * FROM `pegawai` WHERE `id` != 1