models/Pegawai.php

    public static function findIdentity($id)
    {
      return static::findOne(['id'=>$id]);
---
SELECT * FROM `pegawai` WHERE `id`=1

    public static function findByUsername($username)
    {
      return static::findOne(['username'=>$username]);
---
SELECT * FROM `pegawai` WHERE `username`='admin'